/********************************************************
*                                                                                                            
* 文件名  ： RsrCommon.c   
* 版权说明： 北京瑞安时代科技有限责任公司 
* 版本号  ： 1.0
* 创建时间： 2009.10.25
* 作者    ： 车载及协议部
* 功能描述： Rsr层共通定义
* 使用注意： 
*   
* 修改记录：   
*
********************************************************/
#include "RsrCommon.h"
#include "Convert.h"


/*丢包或非宕机错误码记录信息*/
UINT32	gRsrErrorInfo;	

/* 内部全局变量 申明 */
/* RSR_INFO_STRU *gpRsrInfoStru; */	

/*--------------------------------------------------------------------
 * RSR层内公用函数申明 Start
 *--------------------------------------------------------------------*/
/***********************************************************************
 * 方法名   : MemSet
 * 功能描述 : 对指定内存设定指定的值
 * 输入参数 : 
 *	参数名		类型		输入输出	描述
 *  --------------------------------------------------------------
 *	pDestAdd	UINT8 *		INOUT		内存空间开始地址
 *  Len			UINT16		IN			内存空间大小
 *	Val			UINT8		IN			指定值	
 * 
 * 返回值   : 1 正常
 ***********************************************************************/
UINT8 RsrMemSet(UINT8 *pDestAdd, UINT16 Len, UINT8 Val)
{
    UINT16 index = 0;
	
    for(index = 0; index < Len; index++)
    {
	    pDestAdd[index] = Val;
    }

	return (UINT8)1;
}

/***********************************************************************
 * 方法名   : MemSet
 * 功能描述 : 对指定内存设定指定的值
 * 输入参数 : 
 *	参数名		类型			输入输出	    描述
 *  --------------------------------------------------------------
 *  pSrcAdd		const UINT8 *	IN		    源内存空间地址
 *	pDestAdd	UINT8 *			INOUT	    目的内存空间地址
 *  Len			UINT16			IN		    内存空间大小	
 * 
 * 返回值   : 1 正常
 ***********************************************************************/
UINT8 RsrMemCopy(const UINT8 *pSrcAdd,UINT8 *pDestAdd, UINT16 Len)
{
    UINT16 index = 0;
	
    for(index = 0; index < Len; index++)
    {
        pDestAdd[index] = pSrcAdd[index];
    }
    
    return (UINT8)1;
}

/***********************************************************************
 * 方法名   : TypeId2DevName
 * 功能描述 : 根据Type和ID 取得相对应的设备标识
 * 输入参数 : 
 *	参数名		类型			输入输出		描述
 *  --------------------------------------------------------------
 *	 Type		UINT8			IN				类型
 *	 ID			UINT8			IN				Id
 *	 pDevName	UINT16*			OUT				标识
 * 
 * 返回值   : 无
 ***********************************************************************/
void TypeId2DevName(UINT8 Type, UINT8 Id, UINT16* pDevName)
{
#ifdef TYPE_ID_2_DEVNAME_USE_COMM
	UINT8 buff[2];
	buff[0] = Type;
	buff[1] = Id;			  

	*pDevName = ShortFromChar(buff);
#else
	*pDevName = Type;
	*pDevName = (*pDevName)*0x100 + Id;
#endif
	return;
}

/***********************************************************************
 * 方法名   : DevName2TypeId
 * 功能描述 : 根据类型取得相对应的类型和Id
 * 输入参数 : 
 *	参数名		类型			输入输出		描述
 *  --------------------------------------------------------------
 *	 DevName	UINT8			IN			标识
 *	 pType		UINT8*			OUT			类型
 *	 pID		UINT8*			OUT			Id	 
 * 
 * 返回值   : 无
 ***********************************************************************/
void DevName2TypeId(UINT16 DevName, UINT8* pType,UINT8* pId)
{
#ifdef TYPE_ID_2_DEVNAME_USE_COMM
	UINT8 buff[2];
	ShortToChar(DevName,buff);
	*pType = buff[0];
	*pId = buff[1];
#else
	*pId = (UINT8)(DevName % 0x100);
	*pType =(UINT8)(DevName /0x100);
#endif	
	return;
}
/*******************************************************************************************************
* 功能描述: 	   获得RSR协议丢包和非宕机错误码
* 输入参数: 		无
* 输入输出参数: 	无
* 输出参数: 		gRsrErrorInfo
* 全局变量: 	  gRsrErrorInfo
* 返回值:			gRsrErrorInfo
*******************************************************************************************************/

UINT32 GetRsrErrorInfo(void)
{
	UINT32 ret = 0;
	ret = gRsrErrorInfo; 
	return ret;
}
/*******************************************************************************************************
* 功能描述: 	   RSR协议丢包和非宕机错误码复位
* 输入参数: 		无
* 输入输出参数: 	无
* 输出参数: 		gRsrErrorInfo
* 全局变量: 	  gRsrErrorInfo
* 返回值:			1:成功
*******************************************************************************************************/

UINT32 ReSetRsrErrorInfo(void)
{
	UINT32 ret = 1;
	gRsrErrorInfo = 0;	
	return ret;
}

/*--------------------------------------------------------------------
 * RSR层内部共用函数申明 End
 *--------------------------------------------------------------------*/




