
/*******************************************************************************
* 文件名    ：  sigInterface.h
* 版权说明  ：  
* 版本号    ：  1.0  
* 创建时间  ：  2009.11.23
* 作者      ：  
* 功能描述  ：  RSR信号层协议函数头文件
* 使用注意  ： 
           无
* 修改记录  ：  

*******************************************************************************/

#ifndef _SIG_INTERFACE_H
#define _SIG_INTERFACE_H

#include "CommonTypes.h"
#include "Convert.h"
#include "CommonQueue.h"
#include "sigDeclare.h"

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************************
* 功能描述      : 信号层输入处理主函数
* 输入参数      : QueueStruct *RpToSig          冗余层给信号层协议的队列
                  UINT16 LocalName              本方设备类型
* 输入输出参数  : 
* 输出参数      : QueueStruct *SigToRs          信号层给RSSP协议的队列
* 全局变量      :
* 返回值        : 成功返回1,失败返回0        
*******************************************************************************************/
UINT8 SigReceive(UINT16 LocalName, QueueStruct *RpToSig, QueueStruct *SigToRs);


/******************************************************************************************
* 功能描述      : 判断信号层帧头是否合法
* 输入参数      : UINT8 SenderType              发送方Type
                  UINT8 SenderID                发送方ID
                  UINT8 *SigHeader              信号层帧头指针
                  UINT16 LocalName              本方标识(Type+ID)
* 输入输出参数  : 
* 输出参数      : 
* 全局变量      :
* 返回值        : 信号层帧头合法返回1,不合法返回0        
*******************************************************************************************/
UINT8 CheckSigHeader(UINT8 SenderType, UINT8 SenderID, UINT8 *SigHeader, UINT16 LocalName);


/******************************************************************************************
* 功能描述      : 写信号层给RSSP协议的队列
* 输入参数      : UINT8 *SigMsg                 信号层消息
* 输入输出参数  : 
* 输出参数      : QueueStruct *SigToRs          信号层给RSSP协议的队列
* 全局变量      :
* 返回值        : 成功返回1,队列剩余长度不够返回0        
*******************************************************************************************/
UINT8 WriteSigToRs(UINT8 *SigMsg, QueueStruct *SigToRs);


/******************************************************************************************
* 功能描述      : 信号层输出处理主函数
* 输入参数      : QueueStruct *RsToSig          RSSP层给信号层协议的队列
                  UINT16 LocalName              本方设备类型
* 输入输出参数  : 
* 输出参数      : QueueStruct *SigToRp          信号层给冗余层协议的队列
* 全局变量      :
* 返回值        : 成功返回1,失败返回0        
*******************************************************************************************/
UINT8 SigOutput(UINT16 LocalName, QueueStruct *RsToSig, QueueStruct *SigToRp);


/******************************************************************************************
* 功能描述      : 设置信号层帧头
* 输入参数      : UINT8 *FrameBuf               RSSP给信号层协议单帧数据的头指针
                  UINT16 LocalName              本方标识(Type+ID)
* 输入输出参数  : 
* 输出参数      : UINT8 *SigHeaderBuf           信号层帧头
* 全局变量      :
* 返回值        : 设置信号层帧头正确返回1,查询数据库错误返回0        
*******************************************************************************************/
UINT8 SetSigHeader(UINT8 *FrameBuf, UINT8 *SigHeaderBuf, UINT16 LocalName);


/******************************************************************************************
* 功能描述      : 写信号层给冗余层协议的队列
* 输入参数      : UINT8 *SigMsgBody             信号层消息体
                  UINT8 *SigHeaderBuf           信号层帧头
* 输入输出参数  : 
* 输出参数      : QueueStruct *SigToRp          信号层给冗余层协议的队列
* 全局变量      :
* 返回值        : 成功返回1,队列剩余长度不够返回0        
*******************************************************************************************/
UINT8 WriteSigToRp(UINT8 *SigMsgBody, UINT8 *SigHeaderBuf, QueueStruct *SigToRp);

#ifdef __cplusplus
}
#endif

#endif
