
/************************************************************************
*
* 文件名   ：  CommonConfig.h
* 版权说明 ：  北京瑞安时代科技有限责任公司 
* 版本号   ：  1.0
* 创建时间 ：  2009.11.21
* 作者     ：  车载及协议部
* 功能描述 ：  cbtc公共函数配置文件.  
* 使用注意 ： 
* 修改记录 ：  
*
************************************************************************/


#ifndef _COMMONCONFIG_H_
#define _COMMONCONFIG_H_

/*测试平台宏定义*/
#define CBTC_UNITTEST
#define CBTC_INTTEST

/*CBTC系统平台定义*/
#define kWINDOWS  0
#define kMOTOROLA 1
#define kVXWORKS  2

/*在这里定义应用平台*/
/***********************************************************/
#define kPLATFORM kWINDOWS
/***********************************************************/

#endif /* _COMMONCONFIG_H_ */
