/* ***********************************************************************
*
* 文件名      ：  PointCommandManage.h
* 版权说明    ：  北京交控科技有限责任公司
* 版本号      ：  1.0
* 创建时间    ：  2016-6-22
* 作者        ：  闻一龙
* 功能描述    ：  .
* 使用注意    ：  
* 修改记录    ：  2016-6-22 			闻一龙				  创建
                                                                      
*********************************************************************** */
#ifndef _POINTCOMMANDMANAGE_H_
#define _POINTCOMMANDMANAGE_H_

#ifdef __cplusplus
extern "C" {
#endif
/**=============================================================================
    函数名: PointBufferSendManage()
      描述: 道岔缓存区发送管理函数      
      功能: 判断缓存区数组中的道岔命令是否可以发送。如果不能发送（控制用户没有
	  该道岔的独占锁）则删除该道岔命令。
      参数：无
	  返回值: 可以发送：1
	  不可以发送：0
==============================================================================*/
UINT8 PointBufferSendManage(void);
/**=============================================================================
    函数名: PointFaultManage()
      描述: 道岔故障管理函数      
      功能: 判断道岔是否故障，故障后将道岔转入故障状态，即不能接受任何控制。
      参数：无
	  返回值: 判断成功：1
	 判断失败 0
==============================================================================*/
UINT8 PointFaultManage(void);
/**=============================================================================
    函数名: LockQSwitchStatus2SwitchStatus()
      描述: 锁结构里的道岔状态类型转换成道岔自身状态类型，为了锁要求道岔状态与自身道岔状态做比较    
      功能: 锁结构里的道岔状态类型转换成道岔自身状态类型，为了锁要求道岔状态与自身道岔状态做比较  
      参数：锁结构里的道岔状态
	  返回值: 成功：返回内部道岔状态 ；失败：返回0
==============================================================================*/
UINT8 LockQSwitchStatus2SwitchStatus(UINT8 LockQSwitchStatus);
void SwitchSucces(void);
#ifdef __cplusplus
}
#endif
#endif
