
/*******************************************************************************
* 文件名    ：  RpConfig.h
* 版权说明  ：  
* 版本号    ：  1.0  
* 创建时间  ：  2010.05.04
* 作者      ：  李雁
* 功能描述  ：  此文件为RP协议配置文件 ：记录功能打开
* 使用注意  ： 
                无
* 修改记录  ：  

*******************************************************************************/

#ifndef _RPCONFIG_H
#define _RPCONFIG_H

/**************************协议记录宏定义开关**********************************/

/*#define RP_RECORD_ERR_ASC*/     /* 以字符方式记录 */

#define RP_RECORD_SIMPLIFY_BIN		/* 以二进制方式记录 */

#else
#endif

