/******************************************************************************
** 项目名称：客运专线列控系统临时限速服务器
** 版权信息：Copyright (c) 2010-2015，Beijing Jiaoda Microunion Tech Co.,LTD.
** 文件名称：des.h 版本号：V0.0.0
** 创建人：  lcj_109                  创建日期：2010.11.23
** 功能摘要：
** 参考文献：
*******************************************************************************
** 修改日期：
** 修改内容：
******************************************************************************/
#ifndef __DES_H__
#define __DES_H__

#include "typeDefine.h"

#ifdef __cplusplus 
extern "C" { 
#endif 
/* 加解密类型 */
enum { DECRYPT = 0, ENCRYPT = 1 };

/********************************************************************************
** 函数名：buildsubkey
** 功能描述：生成子密钥并保存到内部寄存器
** 输入参数：key: 指向8字节的原始密钥
**           mode: 加密(ENCRYPT=1)或解密(DECRYPT=0)工作模式
** 输出参数：无
** 返回值：无
********************************************************************************/
VOID buildsubkey(BYTE *key, short mode);

/********************************************************************************
** 函数名：setsubkey
** 功能描述：设置内部子密钥寄存器数据
** 输入参数：from: 16组子密钥
** 输出参数：无
** 返回值：无
********************************************************************************/
VOID setsubkey(DWORD *from);

/********************************************************************************
** 函数名：savesubkey
** 功能描述：保存内部的子密钥寄存器数据
** 输入参数：to: 指向存储16组子密钥的缓冲区
** 输出参数：无
** 返回值：无
********************************************************************************/
VOID savesubkey(DWORD *to);

/********************************************************************************
** 函数名：fastdes   
** 功能描述：快速单DES算法主函数
** 输入参数：blockin: 待处理的64位（8字节）数据块
** 输出参数：blockout: 存储处理后数据的8字节数据块
** 返回值：无
********************************************************************************/
VOID fastdes(BYTE *blockin, BYTE *blockout);

#ifdef __cplusplus 
}
#endif 

#endif
